app/controllers/administration_controller.rb

  def index
  	@items=Administration.all
---
SELECT "administrations".* FROM "administrations"

 def show

  	if@items=Administration.where(ApiKey: params[:ApiKey]).empty?
  		@items="Null"

  	else

  		@numeros=params[:palabras].split(",")
  		@vector_posiciones= []
  		@vector_palabras  = []
  		@lista_posiciones=[];
  		@iteraciones=@numeros.length-2

  		@contador=0
  		for dato in (0..@iteraciones)
  			for dato2 in (dato..@iteraciones)
  				if @numeros[dato]==@numeros[dato2+1]
  					@vector_palabras [@contador]=[@numeros[dato],"{"+dato.to_s+","+(dato2+1).to_s+"}"]
  					@vector_posiciones [@contador]="{"+dato.to_s+","+(dato2+1).to_s+"}";
  					#@lista_posiciones=@lista_posiciones+"{"+dato.to_s+","+(dato2+1).to_s+"}"
  					@contador=@contador+1
  			else

  				end
  			end
		end



  		@items=Administration.where(ApiKey: params[:ApiKey]).take
  		@items.update(num: @items.num+1)
---
SELECT  "administrations".* FROM "administrations" WHERE "administrations"."ApiKey" = ? LIMIT ?  [["ApiKey", "123"], ["LIMIT", 1]]
SELECT  1 AS one FROM "administrations" WHERE "administrations"."ApiKey" = ? LIMIT ?  [["ApiKey", "123"], ["LIMIT", 1]]
UPDATE "administrations" SET "ApiKey" = ?, "updated_at" = ? WHERE "administrations"."id" = ?  [["ApiKey", "1"], ["updated_at", "2017-06-12 02:05:00.648230"], ["id", 33]]

  def create


  @correo=params[:administration][:correo];
  @ApiKey=Digest::MD5.hexdigest(params[:administration][:correo]);
  @num=0;

  #@items = Administration.new(params.require(:administration).permit(:correo, :ApiKey))
  @items = Administration.new({:correo=>@correo,:ApiKey=>@ApiKey,:num=>@num});
  if @items.save
---
INSERT INTO "administrations" ("correo", "ApiKey", "num", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["correo", "victor"], ["ApiKey", "ffc150a160d37e92012c196b6af4160d"], ["num", 0], ["created_at", "2017-06-11 04:19:13.991086"], ["updated_at", "2017-06-11 04:19:13.991086"]]